def number(num):
    numb = f'{num:03}'
    hund = numb[0]
    ten = numb[1]
    unit = numb [2]
    hundreds_info  ={
        '1':'сто',
        '2': 'двести',
        '3': 'триста',
        '4': 'четыреста',
        '5': 'пятьсот',
        '6': 'шестьсот',
        '7': 'семьсот',
        '8': 'восемьсот',
        '9': 'девятьсот'
    }
    tens_info  ={
        '2': 'двадцать',
        '3': 'тридцать',
        '4': 'сорок',
        '5': 'пятьдесят',
        '6': 'шестьдесят',
        '7': 'семьдесят',
        '8': 'восемьдесят ',
        '9': 'девяносто'
    }
    teens_info ={
        '1': 'одиннадцать',
        '2': 'двенадцать',
        '3': 'тринадцать',
        '4': 'четырнадцать',
        '5': 'пятнадцать',
        '6': 'шестнадцать',
        '7': 'семнадцать',
        '8': 'восемнадцать ',
        '9': 'девятнадцать'
    }
    units_info ={
        '1': 'один',
        '2': 'два',
        '3': 'три',
        '4': 'четыре',
        '5': 'пять',
        '6': 'шесть',
        '7': 'семь',
        '8': 'восемь ',
        '9': 'девять'
    }
    if num == 0:
        return 'ноль'
    hund = hundreds_info.get(hund)
    if ten == 1:
        ten = teens_info.get(ten)
        unit = ''
    else:
        ten = tens_info.get(ten)
        unit = units_info.get(unit)
    return f'{hund} {ten} {unit}'
print(number(225))